def member(index):
  members = {0:"ヤマボウシ",1:"ツリバナ",2:"サルナシ",3:"ヤマグワ",4:"リョウブ",5:"ナナカマド",
  6:"ミズキ",7:"クリ",8:"ミズナラ",9:"タラノキ",10:"イヌビワ",11:"カナクギノキ",12:"オオカメノキ",
  13:"ウワミズザクラ",14:"ミズメ",15:"イワガラミ",16:"ヤマザクラ",17:"ゴンズイ",18:"ヤブツバキ",
  19:"マンサク",20:"ヒサカキ",21:"カツラ",22:"ヤブニッケイ",23:"ネズミモチ",24:"ヌルデ",
  25:"アカシデ",26:"クマノミズキ",27:"アオハダ",28:"ウラゲエンコウカエデ",29:"ノイバラ",
  30:"ヤブイバラ",31:"ツルウメモドキ",32:"ネジキ",33:"ノリウツギ",34:"サンショウ",35:"フサザクラ",
  36:"イイギリ",37:"ハチジョウキブシ",38:"ウラジロガシ",39:"マルバウツギ",40:"ヤマアジサイ",
  41:"コナラ",42:"マルバアオダモ",43:"コハウチワカエデ",44:"ヒメユズリハ",45:"ヤマウルシ",
  46:"クサギ",47:"ミネカエデ",48:"クロモジ",49:"カマツカ"}
  return members[index]