def member(index):
  members = {0:"コハウチワカエデ",1:"サルナシ",2:"ヌルデ",3:"ヤマウルシ",4:"アオハダ",5:"タラノキ",
  6:"ミズメ",7:"アカシデ",8:"クマシデ",9:"オオカメノキ",10:"ガマズミ",11:"ツリバナ",12:"リョウブ",
  13:"アオキ",14:"ヤマボウシ",15:"クマノミズキ",16:"ミズキ",17:"ヒメユズリハ",18:"ネジキ",
  19:"アセビ",20:"ヤマツツジ",21:"アカメガシワ",22:"フサザクラ",23:"クリ",24:"アカガシ",
  25:"ウラジロガシ",26:"コナラ",27:"ミズナラ",28:"イイギリ",29:"ヤブニッケイ",
  30:"カナクギノキ",31:"クロモジ",32:"イヌビワ",33:"ヤマグワ",34:"ネズミモチ",35:"カマツカ",
  36:"ウワミズザクラ",37:"ヤマザクラ",38:"サンショウ",39:"ウツギ",40:"ノリウツギ",
  41:"イワガラミ",42:"キブシ",43:"ゴンズイ",44:"エゴノキ",45:"ヤブツバキ",
  46:"ヒサカキ",47:"ムラサキシキブ",48:"ヤブムラサキ",49:"クサギ"}
  return members[index]