def member(index,index2):
  members = ["コハウチワカエデ","サルナシ","ヌルデ","ヤマウルシ","アオハダ","タラノキ",
  "ミズメ","アカシデ","クマシデ","オオカメノキ","ガマズミ","ツリバナ","リョウブ",
  "アオキ","ヤマボウシ","クマノミズキ","ミズキ","ヒメユズリハ","ネジキ",
  "アセビ","ヤマツツジ","アカメガシワ","フサザクラ","クリ","アカガシ",
  "ウラジロガシ","コナラ","ミズナラ","イイギリ","ヤブニッケイ",
  "カナクギノキ","クロモジ","イヌビワ","ヤマグワ","ネズミモチ","カマツカ",
  "ウワミズザクラ","ヤマザクラ","サンショウ","ウツギ","ノリウツギ",
  "イワガラミ","キブシ","ゴンズイ","エゴノキ","ヤブツバキ",
  "ヒサカキ","ムラサキシキブ","ヤブムラサキ","クサギ"]
  return members[index:index2]

def member10(index,index2):
  members10 = ["ムラサキシキブ","ヤブツバキ","ウツギ","ヒサカキ","ゴンズイ","ノリウツギ",
  "ヤマザクラ","イワガラミ","キブシ","エゴノキ"]
  return members10[index:index2]